//=============================================================================
// 
//  タイトルヘッダー [title.h]
//  Author : 相馬靜雅
// 
//=============================================================================

#ifndef _TITLE_H_
#define _TITLE_H_	// 二重インクルード防止

#include "main.h"
#include "manager.h"

//==========================================================================
// 前方宣言
//==========================================================================

//==========================================================================
// クラス定義
//==========================================================================
// タイトルクラス定義
class CTitle : public CScene
{
public:

	CTitle();
	~CTitle();

	// オーバーライドされた関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	int GetSwitchWave(void);	// ウェーブ遷移取得
	void SetStageSwitch(void);	// ステージの切り替え設定

private:
	int m_nCntSwitch;		// 切り替えのカウンター
	int m_nSwitchWave;		// ウェーブの遷移
	bool m_bStageSwitch;	// ステージ切り替えのフラグ

};



#endif